{
  "backend/main.mo": "Minimal Motoko backend actor with no methods or state defined.",
  "feature_evidence.json": "Feature evidence report listing implemented features with file targets, component dependencies, test IDs, and confidence levels for the Version 2 rewrite of Binance auth, public API, CORS config removal, and credentials hook.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to short descriptions summarizing each module's purpose and key implementation details.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens (background, foreground, chart colors, sidebar, etc.).",
  "frontend/index.html": "HTML shell for the Collie Trader React app, mounting the app into a root div and loading the main TSX entry point as an ES module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with six routes (Dashboard, AI Insights, Risk, Recovery, Statistics, Settings) wrapped in AppLayout, ThemeProvider (dark), and a Sonner toaster.",
  "frontend/src/components/insights/SentimentCard.tsx": "Displays sentiment analysis results (bullish/bearish/neutral) for a symbol including RSI progress bar, trend direction, and strength indicator.",
  "frontend/src/components/insights/TrendForecastCard.tsx": "Renders trend continuation vs. reversal probability bars with a confidence badge and a list of key factors for a given symbol and modality.",
  "frontend/src/components/layout/AppLayout.tsx": "Application shell providing a sticky top navigation bar with desktop links and a mobile slide-out Sheet menu for all six app routes.",
  "frontend/src/components/recovery/RecoveryPositionCard.tsx": "Displays a card for a losing trade position showing PnL, entry/current/stop-loss prices, and an expandable list of recovery strategies (AverageDown, Hedge, PartialClose, DCA) with an execute button for each.",
  "frontend/src/components/recovery/RecoveryProgressTracker.tsx": "Shows a recovery progress tracker for a symbol, displaying initial loss, current loss, recovered amount, a progress bar, and a log of recovery actions taken with their PnL impact.",
  "frontend/src/components/risk/LeverageBracketTable.tsx": "Renders a table of Binance leverage brackets for a selected symbol, fetching bracket data (max leverage, notional cap, maintenance margin) on demand via a load button.",
  "frontend/src/components/risk/PortfolioExposure.tsx": "Displays per-modality and total portfolio risk exposure as progress bars, calculating capital-at-risk from open trades relative to total capital stored in localStorage.",
  "frontend/src/components/risk/PositionSizeCalculator.tsx": "An interactive calculator that computes optimal position size, risk amount, and position value based on account balance, risk percentage slider, entry price, and stop-loss price.",
  "frontend/src/components/risk/TradeSimulator.tsx": "A trade simulator that calculates projected PnL at up to three take-profit levels and at stop-loss, along with the risk/reward ratio, given entry, stop-loss, TP prices, and position size.",
  "frontend/src/components/statistics/StatCard.tsx": "A simple reusable stat display card that shows a label, a primary value with optional profit/loss/neutral color coding, and an optional sub-value.",
  "frontend/src/components/trading/BinancePositionsList.tsx": "React component that displays a list of open Binance futures positions, fetched on demand via a Load/Refresh button, showing entry price, leverage, and unrealized PnL with profit/loss color coding.",
  "frontend/src/components/trading/ModalityCard.tsx": "React component representing a single trading modality card (Scalping, Day Trade, Swing, Position) that displays an active trade's direction, PnL, TP progress, and duration, with live/sim toggle and generate/close actions.",
  "frontend/src/components/trading/ReversalAlertDialog.tsx": "Modal alert dialog that presents a detected reversal signal with symbol, direction, and price details, offering the user options to dismiss, close the trade early, or reverse the position.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, returning an anonymous or identity-authenticated actor and invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useBinancePairs.ts": "Custom hook that fetches Binance exchange info on mount and returns the first 100 USDT-quoted trading pairs along with loading and error state.",
  "frontend/src/hooks/useCredentials.ts": "Custom hook managing Binance API key/secret state, credential persistence, connection testing with detailed error parsing, and a live-trading toggle stored in localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/clear functions, identity state, and login status to child components.",
  "frontend/src/hooks/useModalityMode.ts": "Custom hook that manages per-modality live/simulated mode state persisted in localStorage, with a toggle function that respects whether live mode is globally allowed.",
  "frontend/src/hooks/usePerformanceStats.ts": "React hook that loads and calculates trade performance statistics, providing per-modality and overall stats with a refresh callback.",
  "frontend/src/hooks/usePricePolling.ts": "React hook that polls Binance for live prices of given symbols at a configurable interval, returning current prices and polling state.",
  "frontend/src/hooks/useQueries.ts": "Placeholder/empty module noting that data fetching is handled via custom hooks rather than ICP backend queries.",
  "frontend/src/hooks/useReversalDetection.ts": "React hook that periodically checks active trades for market reversal signals every 30 seconds and manages dismissal of those signals.",
  "frontend/src/hooks/useTradeLifecycle.ts": "Core React hook managing the full lifecycle of trades across four modalities, including generation, TP/SL checking, closing, and persistence to localStorage.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind, imports JetBrains Mono and Inter fonts, and defines OKLCH-based design tokens and trading-specific utility classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AIInsights.tsx": "Page component that fetches and displays AI-driven sentiment analysis, trend forecasts, and trade advice for each active trade modality.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page rendering four modality trade cards, live Binance positions, and a reversal alert dialog, with price polling and trade lifecycle management.",
  "frontend/src/pages/PositionRecovery.tsx": "Page component that identifies active trades with losses exceeding 20% and displays AI-generated recovery strategies with execution tracking.",
  "frontend/src/pages/RiskManagement.tsx": "Renders the Risk Management page, composing PositionSizeCalculator, PortfolioExposure, LeverageBracketTable, and TradeSimulator components while polling live prices for active trade symbols.",
  "frontend/src/pages/Settings.tsx": "Provides a settings UI for entering, saving, and testing Binance API credentials (stored locally in the browser) and toggling live trading mode.",
  "frontend/src/pages/Statistics.tsx": "Displays overall and per-modality trading performance statistics (win rate, P&L, R:R, streaks, etc.) loaded from trade history storage with a refresh action.",
  "frontend/src/services/ai/aiTradeSelection.ts": "Generates trade setups for a given modality and symbol by fetching klines, running SMC indicator analysis (BOS, FVG, Order Blocks, ATR), and computing entry, stop-loss, and take-profit levels.",
  "frontend/src/services/ai/marketReversalDetector.ts": "Checks for reversal signals (CHoCH and Breaker Blocks) against an active trade's direction using SMC indicators and returns a structured ReversalSignal if a threat is detected.",
  "frontend/src/services/ai/pairScoringEngine.ts": "Empty file with no implemented content.",
  "frontend/src/services/ai/positionRecoveryEngine.ts": "Generates multiple recovery strategies (average down, OB-based averaging, partial close, DCA schedule, hedge) for a losing trade using kline data, ATR, and order block detection.",
  "frontend/src/services/ai/sentimentAnalyzer.ts": "Analyzes market sentiment for a symbol from kline data by computing RSI, MA20, MA50, and trend direction, returning a structured SentimentResult with bullish/bearish/neutral classification and strength score.",
  "frontend/src/services/ai/smcIndicators.ts": "Provides SMC (Smart Money Concepts) technical indicator functions including kline parsing, Break of Structure (BOS) detection, Fair Value Gap (FVG) detection, and Order Block detection from candle data.",
  "frontend/src/services/ai/tradeAdvisor.ts": "Generates actionable trade management advice (tighten SL, take partial, hold, close early) for an active trade based on current price, PnL percentage, and proximity to TP/SL levels.",
  "frontend/src/services/ai/trendForecaster.ts": "Forecasts trend continuation vs. reversal probability for a symbol using RSI, ATR, price momentum, and volume analysis, returning a confidence-rated forecast object.",
  "frontend/src/services/binance/binanceAccountService.ts": "Provides authenticated Binance Futures API calls for fetching account info, position risk, placing orders, and canceling orders using the authenticatedFetch utility.",
  "frontend/src/services/binance/binanceAuth.ts": "Handles Binance API credential storage in localStorage, HMAC-SHA256 request signing via the Web Crypto API, and provides authenticated and public fetch wrappers for Binance Futures endpoints.",
  "frontend/src/services/binance/binancePublicApi.ts": "Exposes unauthenticated Binance Futures public API calls for exchange info, ticker prices, klines, and leverage bracket data.",
  "frontend/src/services/binance/corsConfig.ts": "Empty file with no content or exports.",
  "frontend/src/services/statistics/performanceTracker.ts": "Calculates and persists trade performance statistics (win rate, avg RR, streaks, TP/SL hits, hold duration) per trading modality and overall from closed trade history.",
  "frontend/src/services/storage/tradeStorage.ts": "Manages localStorage persistence for active trades, closed trade history (capped at 500), and trade statistics, with typed load/save/clear helpers.",
  "frontend/src/services/trading/orderExecutor.ts": "Executes trade open and close market orders on Binance Futures when live mode is enabled, or returns a simulated success response when in paper trading mode.",
  "frontend/src/services/trading/tradeLifecycleManager.ts": "Manages trade lifecycle events including PnL calculation, TP/SL checks with breakeven logic, and manual trade closure, persisting closed trades and updating statistics.",
  "frontend/src/types/binance.ts": "TypeScript type definitions for Binance Futures API data structures including exchange info, klines, account assets, positions, orders, and order placement parameters.",
  "frontend/src/types/trade.ts": "Core TypeScript enums and interfaces for the trading system, defining trade modalities, directions, statuses, trade/closed-trade shapes, statistics, reversal signals, and recovery strategies.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color palette (including profit/loss/terminal colors), custom fonts, shadows, border radii, and animation keyframes for the trading UI.",
  "project_state.json": "Project state manifest (version 17) documenting the Collie Trader PWA architecture, existing features, known issues, and a note that the project has been reverted to the exact Version 2 state without CORS proxy or pair scoring engine changes."
}