{
  "backend/main.mo": "Empty Motoko actor serving as the ICP backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting the implementation of the Refresh button in PositionRecovery.tsx, including live data fetching, engine re-execution, UI updates, and loading state handling.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to short descriptions summarizing each file's purpose and key implementation details.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "HTML shell for the Collie Trader app that mounts the React root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with six routes wrapped in AppLayout, ThemeProvider (dark), and a Sonner toaster.",
  "frontend/src/components/insights/SentimentCard.tsx": "Displays sentiment analysis results for a symbol including bullish/bearish/neutral indicator, RSI progress bar, trend direction, and strength percentage.",
  "frontend/src/components/insights/TrendForecastCard.tsx": "Renders a trend forecast card with continuation and reversal probability progress bars, a confidence badge, and a list of key factors.",
  "frontend/src/components/layout/AppLayout.tsx": "App shell component providing a sticky top navigation bar with desktop links and a mobile slide-out sheet menu for all six routes.",
  "frontend/src/components/recovery/RecoveryPositionCard.tsx": "Card component for a deeply negative position showing P&L, entry/current/stop-loss prices, and an expandable list of recovery strategies with execution buttons.",
  "frontend/src/components/recovery/RecoveryProgressTracker.tsx": "Displays a recovery progress tracker for a trading symbol, showing initial loss, current loss, recovered amount, a progress bar, and a list of recovery actions taken.",
  "frontend/src/components/risk/LeverageBracketTable.tsx": "Renders a table of leverage brackets for a selected trading symbol by fetching data from the Binance public API, showing max leverage, notional cap, and maintenance margin ratio.",
  "frontend/src/components/risk/PortfolioExposure.tsx": "Visualizes portfolio risk exposure across different trade modalities using progress bars, calculating each modality's risk amount and percentage of total capital.",
  "frontend/src/components/risk/PositionSizeCalculator.tsx": "An interactive calculator that computes optimal position size based on account balance, risk percentage, entry price, and stop loss, persisting balance to localStorage.",
  "frontend/src/components/risk/TradeSimulator.tsx": "A trade simulator that calculates projected PnL at multiple take-profit levels and stop loss, along with the risk/reward ratio, given entry, direction, and position size inputs.",
  "frontend/src/components/statistics/StatCard.tsx": "A simple reusable stat card component that displays a label, a primary value with optional profit/loss/neutral color coding, and an optional sub-value.",
  "frontend/src/components/trading/BinancePositionsList.tsx": "Fetches and displays open Binance futures positions including entry price, leverage, and unrealized PnL, with long/short badges and a refresh button.",
  "frontend/src/components/trading/ModalityCard.tsx": "Renders a trading modality card (Scalping, Day Trade, Swing, Position) displaying trade details like direction, PnL, TP/SL progress, and duration, with controls to toggle live mode, generate trades, and close positions.",
  "frontend/src/components/trading/ReversalAlertDialog.tsx": "Displays an alert dialog when a market reversal signal is detected, offering options to dismiss, close the trade early, or reverse the position.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both authenticated (Internet Identity) and anonymous access, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useBinancePairs.ts": "Fetches and returns the first 100 USDT-quoted trading pairs from Binance exchange info, with loading and error state.",
  "frontend/src/hooks/useCredentials.ts": "Manages Binance API credentials state, providing save, test connection, and live trading toggle functionality with detailed error message parsing.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login, logout, and identity persistence with status tracking.",
  "frontend/src/hooks/useModalityMode.ts": "Manages per-modality live/simulated trading mode state, persisting selections to localStorage and gating live mode behind a credentials check.",
  "frontend/src/hooks/usePerformanceStats.ts": "Loads and refreshes trade performance statistics from storage, exposing per-modality and overall stats with a manual refresh callback.",
  "frontend/src/hooks/usePricePolling.ts": "Polls Binance for current prices of given symbols at a configurable interval, returning a price map, last update timestamp, and polling status.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module indicating that data fetching is handled via custom hooks using direct Binance API calls rather than the ICP backend.",
  "frontend/src/hooks/useReversalDetection.ts": "Periodically checks active trades for reversal signals every 30 seconds, managing a queue of undismissed signals and exposing the most recent active signal.",
  "frontend/src/hooks/useTradeLifecycle.ts": "Custom React hook that manages the full lifecycle of trades across four modalities, including generating AI-based trade setups, checking TP/SL conditions on price updates, closing/reversing trades, and persisting state to storage.",
  "frontend/src/index.css": "Global stylesheet that imports JetBrains Mono and Inter fonts, configures Tailwind base/components/utilities, defines OKLCH-based CSS design tokens for the dark trading UI theme, and adds trading-specific utility classes like profit/loss colors and glow effects.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider for data fetching and InternetIdentityProvider for ICP authentication wrapping the root App component.",
  "frontend/src/pages/AIInsights.tsx": "Page component that fetches and displays AI-driven sentiment analysis, trend forecasts, and trade advice for all active trades, with a manual refresh button and per-modality insight cards.",
  "frontend/src/pages/Dashboard.tsx": "Main trading dashboard page that renders four modality cards with live price polling, handles trade generation and closing, displays Binance positions, and shows reversal alert dialogs when detected.",
  "frontend/src/pages/PositionRecovery.tsx": "Page that identifies active trades (and live Binance positions) with more than 20% unrealized loss and generates AI recovery strategies, displaying them with progress tracking and action history.",
  "frontend/src/pages/RiskManagement.tsx": "Risk management page that renders a position size calculator, portfolio exposure overview, leverage bracket table, and trade simulator using active trade and live price data.",
  "frontend/src/pages/Settings.tsx": "Settings page component for managing Binance API credentials (key/secret) with show/hide toggles, save, and connection test functionality, plus a live trading toggle.",
  "frontend/src/pages/Statistics.tsx": "Statistics page that displays overall and per-modality trading performance metrics (win rate, P&L, R:R, streaks, etc.) using StatCard components, with a refresh button.",
  "frontend/src/services/ai/aiTradeSelection.ts": "AI trade selection service that fetches USDT perpetual symbols, scores them via the pair scoring engine, and builds TradeSetup objects using SMC indicators (BOS, FVG, Order Blocks) and ATR-based SL/TP calculations.",
  "frontend/src/services/ai/marketReversalDetector.ts": "Detects market reversal signals (CHoCH and Breaker Blocks) against an open trade's direction using SMC indicators, returning a ReversalSignal if a threat is found.",
  "frontend/src/services/ai/pairScoringEngine.ts": "Multi-factor pair scoring engine that combines SMC signals (BOS, FVG, Order Blocks, CHoCH), candlestick pattern detection, RSI, and ATR to score and rank trading symbols for a given modality.",
  "frontend/src/services/ai/positionRecoveryEngine.ts": "Generates recovery strategies (average down, OB-based averaging, partial close, DCA schedule, hedge) for a losing trade using kline data, ATR, and order block detection.",
  "frontend/src/services/ai/sentimentAnalyzer.ts": "Analyzes market sentiment for a symbol using RSI, 20/50-period moving averages, and price trend to return a SentimentResult with bullish/bearish/neutral classification and strength score.",
  "frontend/src/services/ai/smcIndicators.ts": "Provides SMC (Smart Money Concepts) technical indicator functions including Kline parsing, Break of Structure (BOS) detection, Fair Value Gap (FVG) detection, and Order Block detection from candle data.",
  "frontend/src/services/ai/tradeAdvisor.ts": "Analyzes an active trade and current price to generate actionable advice such as tightening stop loss, taking partial profits, or closing early based on PnL and proximity to TP/SL levels.",
  "frontend/src/services/ai/trendForecaster.ts": "Forecasts trend continuation vs. reversal probability for a symbol using RSI, ATR, price momentum, and volume analysis, returning a confidence-rated forecast object.",
  "frontend/src/services/binance/binanceAccountService.ts": "Provides authenticated Binance Futures API calls for fetching account info, open position risk, placing orders, and cancelling orders.",
  "frontend/src/services/binance/binanceAuth.ts": "Handles Binance API credential storage in localStorage, HMAC-SHA256 request signing via the Web Crypto API, and provides authenticated and public fetch helpers targeting fapi.binance.com.",
  "frontend/src/services/binance/binancePublicApi.ts": "Exposes unauthenticated Binance Futures public API calls for exchange info, ticker prices, klines, and leverage bracket data.",
  "frontend/src/services/binance/corsConfig.ts": "Empty file with no content.",
  "frontend/src/services/statistics/performanceTracker.ts": "Calculates and persists trade statistics (win rate, avg R:R, streaks, TP/SL hit counts, etc.) per trading modality and overall from closed trade history.",
  "frontend/src/services/storage/tradeStorage.ts": "Manages localStorage persistence for active trades, closed trade history (capped at 500), and trade statistics, with typed load/save/clear helpers.",
  "frontend/src/services/trading/orderExecutor.ts": "Wraps trade open and close logic to either execute real market orders on Binance Futures (when live mode is enabled and credentials exist) or simulate them silently.",
  "frontend/src/services/trading/tradeLifecycleManager.ts": "Manages trade lifecycle events including PnL calculation, TP/SL checks with automatic breakeven adjustment after TP1, and manual trade closure, persisting closed trades and updating statistics.",
  "frontend/src/types/binance.ts": "TypeScript type definitions for Binance Futures API data structures including exchange info, klines, account assets, positions, orders, and order placement parameters.",
  "frontend/src/types/trade.ts": "Core TypeScript type definitions for the trading system, including enums for modality, direction, and status, plus interfaces for Trade, ClosedTrade, TradeSetup, TradeStatistics, ReversalSignal, and RecoveryStrategy.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color palette (including profit/loss/terminal colors), custom fonts, border radius, box shadows, and animation keyframes for the trading UI.",
  "project_state.json": "Project state document describing Collie Trader's architecture, features, and known issues — a frontend-only React/TypeScript PWA for Binance Futures trading with AI pair selection combining SMC and 8 fundamental analysis modules."
}