{
  "backend/main.mo": "Minimal Motoko actor definition with an empty actor body, serving as the ICP backend entry point.",
  "feature_evidence.json": "Feature evidence report documenting the requirement to route the Binance 'Test Connection' API call exclusively through the single CORS proxy defined in corsConfig.ts, with evidence mapped to useCredentials.ts and Settings.tsx.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files, describing the purpose and key implementation details of each component, page, hook, and service.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens used throughout the application.",
  "frontend/index.html": "HTML shell for the Vite/React app titled 'Collie Trader' that mounts the React root and loads the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with six routes (Dashboard, AIInsights, RiskManagement, PositionRecovery, Statistics, Settings) wrapped in AppLayout, ThemeProvider (dark), and a Sonner toaster.",
  "frontend/src/components/insights/SentimentCard.tsx": "Displays a single symbol's sentiment analysis result including bullish/bearish/neutral label, RSI progress bar, trend direction, and strength percentage.",
  "frontend/src/components/insights/TrendForecastCard.tsx": "Renders trend continuation vs. reversal probability bars with a confidence badge and a list of key contributing factors for a given symbol and modality.",
  "frontend/src/components/layout/AppLayout.tsx": "Application shell providing a sticky top navigation bar with desktop links and a mobile slide-out Sheet menu for all six app routes.",
  "frontend/src/components/recovery/RecoveryPositionCard.tsx": "Displays a card for a losing trade position showing PnL, entry/current/stop-loss prices, and an expandable list of recovery strategies (AverageDown, Hedge, PartialClose, DCA) with execute buttons.",
  "frontend/src/components/recovery/RecoveryProgressTracker.tsx": "Shows a progress tracker for a recovering position, displaying initial loss, current loss, amount recovered, a progress bar, and a history of recovery actions taken.",
  "frontend/src/components/risk/LeverageBracketTable.tsx": "Renders a table of Binance leverage brackets for a selected symbol, fetching data on demand and displaying bracket number, max leverage, notional cap, and maintenance margin ratio.",
  "frontend/src/components/risk/PortfolioExposure.tsx": "Displays per-modality and total portfolio risk exposure as progress bars, calculating capital at risk from open trades relative to total account capital stored in localStorage.",
  "frontend/src/components/risk/PositionSizeCalculator.tsx": "An interactive calculator that computes optimal position size in contracts and USDT value based on account balance, risk percentage slider, entry price, and stop-loss price.",
  "frontend/src/components/risk/TradeSimulator.tsx": "A trade simulator that calculates and displays projected PnL at up to three take-profit levels and the stop-loss, along with the risk/reward ratio, given entry, SL, TP prices, and position size.",
  "frontend/src/components/statistics/StatCard.tsx": "A simple reusable card component that displays a labeled statistic value with optional sub-value and color coding for profit, loss, or neutral states.",
  "frontend/src/components/trading/BinancePositionsList.tsx": "React component that displays a list of open Binance futures positions, fetched on demand via a Load/Refresh button, showing symbol, entry price, leverage, and unrealized PnL with profit/loss color coding.",
  "frontend/src/components/trading/ModalityCard.tsx": "React component representing a single trading modality card (Scalping, Day Trade, Swing, Position) that displays an active trade's direction, PnL, TP progress, duration, and rationale, with controls to toggle live mode, generate a trade, or close it.",
  "frontend/src/components/trading/ReversalAlertDialog.tsx": "Modal alert dialog that notifies the user of a detected reversal signal for an active trade, offering options to dismiss, close the trade early, or reverse the position.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useBinancePairs.ts": "Custom hook that fetches Binance exchange info on mount and returns the first 100 USDT-quoted trading pairs along with loading and error state.",
  "frontend/src/hooks/useCredentials.ts": "Custom hook that manages Binance API credentials, providing save, test-connection, and live-trading toggle functionality with detailed user-friendly error message parsing.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook using DFINITY's AuthClient, exposing login, logout, identity, and login status to the React component tree via a context provider.",
  "frontend/src/hooks/useModalityMode.ts": "Custom hook that manages per-modality live/simulated mode state persisted in localStorage, with a toggle function that respects whether live mode is globally allowed.",
  "frontend/src/hooks/usePerformanceStats.ts": "Custom hook that loads and calculates trade performance statistics, providing per-modality and overall stats with a refresh callback.",
  "frontend/src/hooks/usePricePolling.ts": "Custom hook that polls Binance for live prices of given symbols at a configurable interval, returning current prices and polling state.",
  "frontend/src/hooks/useQueries.ts": "Placeholder/empty module noting that data fetching is handled via custom hooks rather than ICP backend queries.",
  "frontend/src/hooks/useReversalDetection.ts": "Custom hook that periodically checks active trades for market reversal signals every 30 seconds and manages dismissal of those signals.",
  "frontend/src/hooks/useTradeLifecycle.ts": "Core trading hook managing the full lifecycle of trades across modalities, including AI-driven trade generation, TP/SL checks, persistence, and manual close/reverse operations.",
  "frontend/src/index.css": "Global stylesheet importing JetBrains Mono and Inter fonts, configuring Tailwind with OKLCH-based design tokens, and defining trading-specific utility classes for profit/loss/warning states.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AIInsights.tsx": "Page that fetches and displays AI-generated sentiment, trend forecast, and trade advice for each active trade using kline data from Binance.",
  "frontend/src/pages/Dashboard.tsx": "Main trading dashboard page rendering modality cards for all four trade types, handling AI trade generation, price polling, TP/SL updates, and reversal alerts.",
  "frontend/src/pages/PositionRecovery.tsx": "Page that identifies active trades with losses exceeding 20% and displays AI-generated recovery strategies with execution tracking.",
  "frontend/src/pages/RiskManagement.tsx": "Renders the Risk Management page, composing PositionSizeCalculator, PortfolioExposure, LeverageBracketTable, and TradeSimulator components with live price polling for active trade symbols.",
  "frontend/src/pages/Settings.tsx": "Renders the Settings page for managing Binance API credentials (stored locally), toggling live trading mode, and displaying a warning about the active CORS proxy.",
  "frontend/src/pages/Statistics.tsx": "Renders the Statistics & Performance page, displaying overall and per-modality trade stats (win rate, P&L, streaks, TP hits) using StatCard components sourced from trade history.",
  "frontend/src/services/ai/aiTradeSelection.ts": "Fetches perpetual symbols and kline data, applies SMC indicators (BOS, FVG, Order Blocks, ATR) to generate TradeSetup objects for a given modality, with ATR-based TP/SL levels.",
  "frontend/src/services/ai/marketReversalDetector.ts": "Analyzes kline data for an active trade to detect CHoCH or Breaker Block signals that oppose the trade direction, returning a ReversalSignal if found.",
  "frontend/src/services/ai/pairScoringEngine.ts": "Scores trading symbols 0–100 for a given modality by combining SMC signals (BOS, FVG, Order Blocks), RSI, ATR, and candlestick pattern detection, returning ranked ScoredSymbol results.",
  "frontend/src/services/ai/positionRecoveryEngine.ts": "Generates recovery strategies (average down, OB-based averaging, partial close, DCA schedule, hedge) for a losing trade using kline-derived ATR and Order Block data.",
  "frontend/src/services/ai/sentimentAnalyzer.ts": "Analyzes market sentiment for a symbol using RSI, MA20, and MA50 indicators derived from kline data, returning a sentiment result (bullish/bearish/neutral) with trend direction and strength score.",
  "frontend/src/services/ai/smcIndicators.ts": "Provides SMC (Smart Money Concepts) technical indicator utilities including kline parsing, Break of Structure (BOS), Fair Value Gap (FVG), and Order Block detection, plus RSI and ATR calculations.",
  "frontend/src/services/ai/tradeAdvisor.ts": "Generates actionable trade management advice (tighten SL, take partial profit, close early, hold) based on a trade's current PnL, proximity to TP1, and distance to stop loss.",
  "frontend/src/services/ai/trendForecaster.ts": "Forecasts trend continuation vs. reversal probability for a symbol by scoring RSI momentum, price momentum, ATR volatility, and volume trends from kline data.",
  "frontend/src/services/binance/binanceAccountService.ts": "Provides authenticated Binance Futures account operations including fetching account info, open position risks, placing orders, and cancelling orders via the authenticated fetch utility.",
  "frontend/src/services/binance/binanceAuth.ts": "Handles Binance API credential storage, client-side HMAC-SHA256 request signing, and authenticated/public fetch wrappers that route requests through a CORS proxy as a temporary workaround.",
  "frontend/src/services/binance/binancePublicApi.ts": "Wraps Binance Futures public REST endpoints for exchange info, ticker prices, klines, and leverage brackets, routing all requests through the CORS proxy via publicFetch.",
  "frontend/src/services/binance/corsConfig.ts": "Exports the CORS proxy URL (corsproxy.io) used as a temporary workaround to bypass browser CORS restrictions when calling Binance Futures API endpoints directly.",
  "frontend/src/services/statistics/performanceTracker.ts": "Calculates and persists trade performance statistics (win rate, avg R:R, PnL, streaks, TP/SL hit counts) broken down by trading modality and overall from closed trade history.",
  "frontend/src/services/storage/tradeStorage.ts": "Provides localStorage persistence helpers for active trades, closed trade history (capped at 500), and trade statistics, with safe JSON parse/stringify wrappers.",
  "frontend/src/services/trading/orderExecutor.ts": "Handles trade order execution by either simulating (paper mode) or placing real market orders on Binance Futures, checking live-mode eligibility via stored credentials.",
  "frontend/src/services/trading/tradeLifecycleManager.ts": "Manages trade lifecycle logic including PnL calculation, TP1/TP2/TP3 and SL hit detection (with breakeven SL move on TP1), and manual trade closure, persisting closed trades and updating statistics.",
  "frontend/src/types/binance.ts": "TypeScript type definitions for Binance Futures API entities including exchange info, klines, account/position data, orders, and order placement parameters.",
  "frontend/src/types/trade.ts": "Core trade domain types and enums defining TradeModality, TradeDirection, TradeStatus, Trade, ClosedTrade, TradeStatistics, TradeSetup, ReversalSignal, and RecoveryStrategy.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH color palette (terminal, profit/loss, chart, sidebar), custom fonts, shadows, border radii, and animation keyframes.",
  "project_state.json": "Project state document describing Collie Trader's architecture, features, known CORS issues, and AI-driven pair selection system for a frontend-only Binance Futures PWA."
}