{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence requirements (REQ-47, REQ-48) for decoupling position recovery state from polling and ensuring mount-only initial load in PositionRecovery.tsx.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to short descriptions summarizing each component, service, or page's purpose in the Collie Trader app.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes including colors, borders, charts, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell for the Collie Trader app that mounts the React app into a root div and loads the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with six routes (Dashboard, AI Insights, Risk, Recovery, Statistics, Settings) wrapped in AppLayout, ThemeProvider (dark), and Sonner toaster.",
  "frontend/src/components/insights/SentimentCard.tsx": "Displays a sentiment analysis result card for a symbol showing bullish/bearish/neutral status, RSI progress bar, trend direction, and strength indicator.",
  "frontend/src/components/insights/TrendForecastCard.tsx": "Renders a trend forecast card with continuation and reversal probability progress bars, a confidence badge, and a list of key contributing factors.",
  "frontend/src/components/layout/AppLayout.tsx": "Application shell providing a sticky top navigation bar with desktop links and a mobile slide-out sheet menu for all six app routes.",
  "frontend/src/components/recovery/RecoveryPositionCard.tsx": "Displays a card for a losing trade position showing PnL, entry/current/stop-loss prices, and an expandable list of recovery strategies (AverageDown, Hedge, PartialClose, DCA) with an execute button for each.",
  "frontend/src/components/recovery/RecoveryProgressTracker.tsx": "Shows a recovery progress tracker for a symbol, displaying initial loss, current loss, recovered amount, a progress bar, and a log of recovery actions taken with their PnL impact.",
  "frontend/src/components/risk/LeverageBracketTable.tsx": "Renders a table of Binance leverage brackets for a selected symbol, fetching data on demand and displaying bracket number, max leverage, notional cap, and maintenance margin ratio.",
  "frontend/src/components/risk/PortfolioExposure.tsx": "Displays per-modality and total portfolio risk exposure as progress bars, calculating capital-at-risk from open trades relative to total capital stored in localStorage.",
  "frontend/src/components/risk/PositionSizeCalculator.tsx": "An interactive calculator that computes optimal position size in contracts and USDT value based on account balance, risk percentage slider, entry price, and stop-loss price.",
  "frontend/src/components/risk/TradeSimulator.tsx": "A trade simulator that calculates projected PnL at up to three take-profit levels and the stop-loss, plus the risk/reward ratio, given entry, stop-loss, and position size inputs.",
  "frontend/src/components/statistics/StatCard.tsx": "A simple reusable card component that displays a labeled statistic value with optional sub-value and color-coded styling for profit, loss, or neutral states.",
  "frontend/src/components/trading/BinancePositionsList.tsx": "React component that displays a list of open Binance futures positions, fetched on demand via a Load/Refresh button, showing symbol, entry price, leverage, and unrealized PnL.",
  "frontend/src/components/trading/ModalityCard.tsx": "React component representing a single trading modality card (Scalping, Day Trade, Swing, Position) that displays trade details, PnL, TP progress, duration, and controls for live toggle, close, and AI signal generation.",
  "frontend/src/components/trading/ReversalAlertDialog.tsx": "Modal alert dialog that presents a detected reversal signal with symbol, direction, and price details, offering the user options to dismiss, close the trade early, or reverse the position.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, returning an authenticated or anonymous actor based on the current Internet Identity, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useBinancePairs.ts": "Custom hook that fetches Binance exchange info on mount and returns the first 100 USDT-quoted trading pairs along with loading and error state.",
  "frontend/src/hooks/useCredentials.ts": "Custom hook managing Binance API credentials state, providing save, test-connection (with detailed error parsing), and live-trading toggle functionality backed by localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY Internet Identity authentication, exposing login/clear functions and status flags via React context.",
  "frontend/src/hooks/useModalityMode.ts": "Custom hook that manages per-modality live/simulated mode state persisted in localStorage, with a toggle function that respects live-mode permission checks.",
  "frontend/src/hooks/usePerformanceStats.ts": "Custom hook that loads or calculates trade performance statistics, provides a refresh function, and exposes helpers to look up stats by modality or retrieve overall stats.",
  "frontend/src/hooks/usePricePolling.ts": "Custom hook that polls Binance for current prices of given symbols at a configurable interval, returning the latest price map, last update timestamp, and polling state.",
  "frontend/src/hooks/useQueries.ts": "Placeholder/empty module noting that the app uses direct Binance API calls instead of ICP backend queries; exports nothing.",
  "frontend/src/hooks/useReversalDetection.ts": "Custom hook that periodically checks active trades for reversal signals every 30 seconds, tracks dismissed signals, and exposes the first active signal and a dismiss callback.",
  "frontend/src/hooks/useTradeLifecycle.ts": "Core trading hook that manages active trades per modality, handles TP/SL checks, AI-driven trade generation, trade opening/closing/reversing, and persists state to local storage.",
  "frontend/src/index.css": "Global stylesheet that imports JetBrains Mono and Inter fonts, configures Tailwind with OKLCH-based CSS custom properties for a dark trading UI theme, and defines utility classes for profit/loss/warning colors and terminal text.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/AIInsights.tsx": "Page component that fetches and displays AI-generated sentiment, trend forecast, and trade advice for each active trade, with a manual refresh button.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page rendering four modality trade cards, live Binance positions, and a reversal alert dialog, with price polling and trade lifecycle management wired together.",
  "frontend/src/pages/PositionRecovery.tsx": "Page that identifies active or live Binance positions with more than 20% unrealized loss and generates AI recovery strategies, displaying them in recovery cards with a progress tracker.",
  "frontend/src/pages/RiskManagement.tsx": "Renders the Risk Management page, composing PositionSizeCalculator, PortfolioExposure, LeverageBracketTable, and TradeSimulator components with live price polling for active trade symbols.",
  "frontend/src/pages/Settings.tsx": "Provides a settings UI for saving and testing Binance API credentials (stored locally in the browser) and toggling live trading mode.",
  "frontend/src/pages/Statistics.tsx": "Displays overall and per-modality trading performance statistics (win rate, P&L, R:R, streaks, etc.) loaded from local trade history with a refresh button.",
  "frontend/src/services/ai/aiTradeSelection.ts": "Fetches USDT perpetual symbols and kline data, applies SMC indicators (BOS, FVG, Order Blocks, ATR) to build TradeSetup objects, and scores symbols per trading modality to select the best trade candidate.",
  "frontend/src/services/ai/marketReversalDetector.ts": "Analyzes kline data for a given trade using CHoCH and Order Block detection to identify reversal signals that conflict with the current trade direction.",
  "frontend/src/services/ai/pairScoringEngine.ts": "Scores trading pairs by combining SMC signals (BOS, FVG, Order Blocks, CHoCH) with candlestick pattern detection, RSI, ATR, and modality-specific weighting to produce ranked symbol scores with top contributing factors.",
  "frontend/src/services/ai/positionRecoveryEngine.ts": "Generates recovery strategies (average down, partial close, DCA, hedge, order-block-based averaging) for a losing trade using kline-derived ATR and order block levels.",
  "frontend/src/services/ai/sentimentAnalyzer.ts": "Analyzes market sentiment for a symbol using RSI, MA20, and MA50 indicators derived from kline data, returning a bullish/bearish/neutral classification with trend direction and strength score.",
  "frontend/src/services/ai/smcIndicators.ts": "Provides SMC (Smart Money Concepts) technical indicator utilities including kline parsing, BOS (Break of Structure), FVG (Fair Value Gap), Order Block detection, RSI, and ATR calculations.",
  "frontend/src/services/ai/tradeAdvisor.ts": "Generates actionable trade management advice (tighten SL, take partial profit, close early, hold) based on a trade's current PnL, proximity to TP1, and distance to stop loss.",
  "frontend/src/services/ai/trendForecaster.ts": "Forecasts trend continuation vs. reversal probability for a symbol by scoring RSI momentum, price momentum, volatility, and volume factors from kline data.",
  "frontend/src/services/binance/binanceAccountService.ts": "Provides authenticated Binance Futures API calls for fetching account info, open position risks, placing orders, and canceling orders.",
  "frontend/src/services/binance/binanceAuth.ts": "Handles Binance API credential storage in localStorage and provides authenticated (HMAC-SHA256 signed) and public fetch helpers targeting fapi.binance.com directly from the browser.",
  "frontend/src/services/binance/binancePublicApi.ts": "Wraps Binance Futures public REST endpoints for exchange info, ticker prices, klines, and leverage bracket data using unauthenticated fetch calls.",
  "frontend/src/services/binance/corsConfig.ts": "Empty file with no content.",
  "frontend/src/services/statistics/performanceTracker.ts": "Calculates and persists trade statistics (win rate, avg R:R, streaks, TP/SL hit counts, hold duration) per trading modality and overall from closed trade history.",
  "frontend/src/services/storage/tradeStorage.ts": "Manages localStorage persistence for active trades, closed trade history (capped at 500), and trade statistics, with typed load/save/clear helpers.",
  "frontend/src/services/trading/orderExecutor.ts": "Handles live/simulated trade order execution by calling the Binance placeOrder API for opening and closing positions, returning success/failure results. Checks localStorage and credentials to determine if live trading is allowed.",
  "frontend/src/services/trading/tradeLifecycleManager.ts": "Manages trade lifecycle logic including PnL calculation, TP/SL level checking with breakeven SL adjustment after TP1, and manual trade closure, persisting closed trades and updating statistics.",
  "frontend/src/types/binance.ts": "TypeScript type definitions for Binance Futures API data structures including exchange info, klines, account assets, positions, orders, and order placement parameters.",
  "frontend/src/types/trade.ts": "TypeScript enums and interfaces defining the core trading domain model: trade modalities, directions, statuses, trade/closed-trade shapes, statistics, reversal signals, and recovery strategies.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color palette (including terminal, profit/loss, chart, and sidebar tokens), custom fonts, shadows, border radii, and animation keyframes.",
  "project_state.json": "Project state document (version 25) describing the Collie Trader PWA architecture, features, AI pair-scoring engine design (SMC + 8 fundamental modules), known issues, and implementation notes for a frontend-only Binance Futures trading app."
}