{
  "kind": "build_request",
  "title": "Fix Position Recovery Refresh Button — Wire to Binance API + positionRecoveryEngine",
  "projectName": "Collie Trader",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-46",
      "text": "In `frontend/src/pages/PositionRecovery.tsx`, wire the Refresh button to a real async action that: (1) calls `getPositionRisk()` from `binanceAccountService.ts` to fetch live position data from `GET https://fapi.binance.com/fapi/v2/positionRisk`; (2) re-executes the `positionRecoveryEngine` logic against the freshly fetched positions to detect those with unrealized loss exceeding 20%; (3) updates the displayed list of deeply negative positions with the new results; and (4) shows a loading spinner or disabled state on the Refresh button while the operation is in progress, restoring to normal after completion or on error.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-1",
          "msg-recent-2",
          "msg-recent-3"
        ],
        "quotes": [
          "Verifique se ao clicar no botao 'refresh' uma ordem realmente é enviada a area correspondente",
          "Rebuscar as posições da Binance via GET /fapi/v2/positionRisk",
          "Re-executar o positionRecoveryEngine para detectar posições em perda significativa",
          "Mostrar um spinner/loading durante o processo"
        ]
      },
      "acceptanceCriteria": [
        "Clicking the Refresh button triggers a real HTTP call to `GET /fapi/v2/positionRisk` via `getPositionRisk()` from `binanceAccountService.ts`.",
        "While the fetch is in progress, the Refresh button shows a loading spinner and is disabled to prevent duplicate requests.",
        "After the fetch completes, `positionRecoveryEngine` is re-executed with the new position data and the displayed list of recovery candidates is updated.",
        "Positions with unrealized loss greater than 20% appear in the list after refresh.",
        "If the fetch fails (e.g., no credentials, network error), an error message is shown and the Refresh button returns to its normal state.",
        "If credentials are not configured (no API key/secret in localStorage), the Refresh button either shows a warning or is disabled with a tooltip explaining that credentials are required."
      ]
    }
  ],
  "constraints": [
    "Do not modify files listed under frontend.immutablePaths.",
    "Credentials must never be sent to any backend — all Binance API calls remain client-side.",
    "All authenticated Binance calls must use `authenticatedFetch` from `binanceAuth.ts` (no direct fetch to Binance URLs bypassing it)."
  ],
  "nonGoals": [
    "Do not change the recovery strategy logic inside `positionRecoveryEngine.ts`.",
    "Do not change the detection threshold (20% loss) unless explicitly requested.",
    "Do not modify any other tabs or pages.",
    "Do not add new recovery strategy types."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}