{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Position Recovery Refresh Button — Wire to Binance API + positionRecoveryEngine",
  "requirements": [
    {
      "id": "REQ-46",
      "summary": "Wire the Refresh button in PositionRecovery.tsx to fetch live position data from Binance, re-execute positionRecoveryEngine logic to detect positions with unrealized loss exceeding 20%, update the displayed list, and show loading state during the operation",
      "acceptanceCriteria": [
        "Clicking the Refresh button triggers a real HTTP call to `GET /fapi/v2/positionRisk` via `getPositionRisk()` from `binanceAccountService.ts`.",
        "While the fetch is in progress, the Refresh button shows a loading spinner and is disabled to prevent duplicate requests.",
        "After the fetch completes, `positionRecoveryEngine` is re-executed with the new position data and the displayed list of recovery candidates is updated.",
        "Positions with unrealized loss greater than 20% appear in the list after refresh.",
        "If the fetch fails (e.g., no credentials, network error), an error message is shown and the Refresh button returns to its normal state.",
        "If credentials are not configured (no API key/secret in localStorage), the Refresh button either shows a warning or is disabled with a tooltip explaining that credentials are required."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PositionRecovery.tsx",
          "operation": "modify",
          "description": "Add async refresh handler that: (1) checks if Binance credentials exist in localStorage via binanceAuth.ts helpers; (2) sets loading state and disables the Refresh button; (3) calls getPositionRisk() from binanceAccountService.ts to fetch live position data from GET /fapi/v2/positionRisk using authenticatedFetch; (4) filters positions with unrealized loss exceeding 20%; (5) for each deeply negative position, re-executes positionRecoveryEngine logic to generate recovery strategies; (6) updates the displayed list of recovery candidates with the fresh results; (7) clears loading state and re-enables the Refresh button; (8) displays error toast if the fetch fails or credentials are missing. Ensure the button shows a loading spinner icon while the operation is in progress."
        }
      ]
    }
  ]
}