{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Position Recovery tab: stabilize detected positions to prevent flicker and spontaneous disappearance",
  "requirements": [
    {
      "id": "REQ-47",
      "summary": "Decouple detected deeply-negative positions state from automatic polling or periodic re-fetch cycles",
      "acceptanceCriteria": [
        "When real Binance positions with >20% unrealized loss are detected on page mount, they remain visible in the Position Recovery tab without flickering or disappearing.",
        "Spontaneous re-renders (e.g., caused by price polling from Dashboard or shared context updates) do not clear or reset the list of detected recovery positions.",
        "The detected positions list only changes when the user clicks the Refresh button.",
        "After clicking Refresh, the button shows a loading/disabled state while fetching, then restores to normal — and the new results are stably displayed.",
        "If no positions meet the >20% loss threshold, a stable 'No positions in critical loss' empty state is shown (not a flickering blank)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PositionRecovery.tsx",
          "operation": "modify",
          "description": "Introduce a dedicated local React state variable using useState to hold the detected recovery positions array, initialized to an empty array. Remove any reactive dependencies or derived computations that automatically update this state based on props, shared context, or polling cycles. Ensure the state is only mutated via two explicit actions: (1) initial page mount load, and (2) user-triggered Refresh button click. Add a loading state to control the Refresh button's disabled/loading indicator. Preserve all existing UI rendering logic including RecoveryPositionCard and RecoveryProgressTracker components."
        }
      ]
    },
    {
      "id": "REQ-48",
      "summary": "Ensure initial load of positions on mount calls getPositionRisk and stores results in stable local state",
      "acceptanceCriteria": [
        "On first render of the Position Recovery page, getPositionRisk() is called once and the results are processed by positionRecoveryEngine.",
        "The recovery positions state is initialized with useState([]) and only mutated via the initial load and explicit Refresh action.",
        "No reactive dependency (price map, shared trade state, etc.) causes the recovery positions to be re-computed or cleared automatically.",
        "The page displays the stable list of detected positions without any flicker on initial load or during background activity in other tabs/components."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PositionRecovery.tsx",
          "operation": "modify",
          "description": "Implement a useEffect hook with an empty dependency array that runs only on component mount. Inside this effect, call getPositionRisk() from binanceAccountService.ts to fetch live Binance position data, then pass the results to positionRecoveryEngine to identify positions with >20% unrealized loss, and store the output in the stable useState recovery positions array. Ensure this logic is duplicated in the Refresh button handler so both initial load and manual refresh follow the same data flow. Do not derive recovery positions from any reactive state variables (price map, shared trade context, or props). Confirm that no other useEffect or reactive computation can overwrite or clear this state."
        }
      ]
    }
  ]
}